MapCoordinateTable = {
    'ЗЩ': '55.917435,38.028332',
    'ЗП': '56.362648418626925,38.1754601072619',
    '️КарьерСильницкий': '56.94091937142843,39.302723071369385',
    '️КарьерНерудПром': '56.861473,39.103031',
    '️КарьерМВК': '56.50650442111945,38.63897583037276',
    'Открытое30': '55.82834407,37.770358',
    'Долматово': '55.336014,37.739815',
    'Чулковское': '55.53631857019112,38.08103170400929',
    'ГенералаДорохова': '55.70859857064804,37.44834881463478',
    'КарьерХорошего': '56.583931,38.535072',
    'Книжная': '55.909946,37.899387',
    'ТракХолдинг': '55.982674,37.866776',
    'Ленина2а': '55.923794393946906,37.80811677612686',
    'ЗаречнаяСнег': '55.924244,38.049576',
    'Назимиха': '55.980682373046875,38.09538269042969',
    'СервисНогинск': '55.829086,38.389233',
    'ПортТураево': '55.558804,37.934391',
    'Лыткарино': '55.558570861816406,37.93376541137695',
    # 'Набережная': '55.751330, 37.526896,'
}

# for x in MapCoordinateTable:
#     print(MapCoordinateTable[x])


def getRad(region):
    if region == 'ЗЩ':
        rad = 0.25
    elif region == '️КарьерМВК':
        rad = 3.5
    elif region == 'ЗП':
        rad = 0.5
    elif region == 'ТракХолдинг':
        rad = 0.5
    elif region == '️КарьерСильницкий':
        rad = 4
    elif region == 'Долматово':
        rad = 1
    elif region == 'Открытое30':
        rad = 1
    elif region == 'Книжная':
        rad = 0.2
    elif region == 'Ленина2а':
        rad = 0.2
    elif region == 'ЗаречнаяСнег':
        rad = 0.4
    elif region == 'Назимиха':
        rad = 0.4
    elif region == 'СервисНогинск':
        rad = 0.4
    elif region == 'КарьерХорошего':
        rad = 0.4
    elif region == '️КарьерНерудПром':
        rad = 1
    elif region == 'ПортТураево':
        rad = 1
    elif region == 'Лыткарино':
        rad = 1
    # elif region == 'Набережная':
    #     rad = 1
    elif region == 'Чулковское':
        rad = 1
    elif region == 'ГенералаДорохова':
        rad = 1
    else:
        rad = 1
    return rad

